Repository: 84000/data-translation-memory
Catalog: toh503_84000-the-detailed-account-of-the-previous-aspirations-of-the-seven-thus-gone-ones.tmx
Source language: bo
Languages: en

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་བཟངས་དྲི་མེད་རིན་ཆེན་སྣང་བརྟུལ་ཞུགས་གྲུབ་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་ས་གཞི་ལ་རིན་པོ་ཆེའི་སྤོས་སྣ་ཚོགས་གནས་པ། ཙནྡན་སྦྲུལ་གྱི་སྙིང་པོའི་དྲི་དང་ལྡན་པ་མཉམ་པ།
en: “Mañjuśrī, the blessed, thus-gone, worthy, perfect Buddha Suvarṇa­bhadra­vimala­ratna­prabhā­savrata­siddhi’s buddhafield is a place where the ground contains various precious fragrances and has the sweet smell of snake’s delight sandalwood.

source: ཡངས་པ་ཐ་གྲུ་ཆེ་བ། ཙནྡན་སྦྲུལ་གྱི་སྙིང་པོའི་དྲིའི་ཤིང་ལྗོན་པས་མཛེས་པར་བྱས་པ། ལྷའི་ནོར་བུ་དང་། མུ་ཏིག་གི་རྒྱན་ཕྲེང་དང་། རིན་པོ་ཆེ་དཔྱངས་པ།
en: It is even, spacious, wide, and beautified by fragrant snake’s delight sandalwood trees hung with divine jewels, decorative pearl garlands, and precious jewels.

source: ལྷའི་ནོར་བུ་རིན་པོ་ཆེའི་རྫིང་སྤོས་ཆུས་ཡོངས་སུ་གང་བས་མཛེས་པར་བྱས་པ།
en: There are pools made of divine, precious gems and that are filled with perfumed water.

source: དར་གྱི་ལྡ་ལྡི་བྲེས་ཤིང་དཔྱངས་པ། རིན་པོ་ཆེའི་སྐུད་པས་མིག་མངས་རིས་སུ་བྲེས་པ།
en: The trees are festooned and adorned with silk streamers, and precious threads form webs between them.

source: ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། སྡུག་བསྔལ་དང་ཡིད་མི་བདེ་བ་མེད་པ།
en: There are no derivative afflictions and no suffering or unhappiness.

source: བྱང་ཆུབ་སེམས་དཔའ་དག་པ་རྣམས་ཀྱིས་རོལ་མོའི་སྒྲ་དང་། སིལ་སྙན་དང་། གླུ་དབྱངས་མ་བླངས་པར་སྒྲ་འབྱུང་བ།
en: The sound of music, instruments, and songs of bodhisattvas are heard without anyone playing them.

source: སིལ་སྙན་དེ་དག་ལས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་སྒྲ་དང་། ཐེག་པ་ཆེན་པོའི་གཏམ་གྱི་སྒྲ་འབྱུང་བ། སྒྲ་དེ་ཐོས་པས་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བའོ།
en: The melody of nature devoid of substance and the melody of the teachings of the Great Vehicle resound from those instruments, and anyone who hears this no longer regresses on the path to the awakening of a buddha.

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཐབས་མཁས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་ནི་དེ་ལྟ་བུའོ།
en: Mañjuśrī, such are the skillful means of that blessed one’s previous aspirations and the fantastic array of good qualities of his buddhafield.

source: །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་གསེར་བཟངས་དྲི་མེད་རིན་ཆེན་སྣང་བརྟུལ་ཞུགས་གྲུབ་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སྔོན་གྱི་སྨོན་ལམ་གྱི་སྟོབས་ཀྱིས་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ་བཞུགས་ཏེ། སེམས་ཅན་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་བསྒྲིབས་པ་རྣམས་གཟིགས་ཤིང་།
en: “The power of the aspirations that the blessed thus-gone Suvarṇa­bhadra­vimala­ratna­prabhā­savrata­siddhi made before becoming a perfect buddha who has realized unsurpassed and perfect awakening led him to sit at the foot of the Bodhi tree and see that all beings are veiled by desire, hatred, and delusion.

source: ནད་སྣ་ཚོགས་ཀྱིས་ལུས་གཟིར་བ། འཆི་བ་དང་། དགྲ་དང་། དགོན་པས་གནོད་པར་གྱུར་པ།
en: He saw that all beings have bodies tormented by various diseases, that they are harmed by death, enemies, and the wilderness, and that they are on the way to becoming hell beings whose lifespans last an entire eon.

source: ཚེ་བསྐལ་པར་ཐུབ་པའི་སེམས་ཅན་དམྱལ་བར་གཞོལ་བའི་སེམས་ཅན་རྣམས་གཟིགས་ནས་སེམས་ཅན་དེ་དག་གི་དོན་དང་། སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་དགོད་པ་དང་། ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་ཟད་པར་བྱ་བའི་ཕྱིར་གཟུངས་སྔགས་ཀྱི་གཞི་འདི་དག་གསུངས་སོ། །ཏ་དྱ་ཐ། སིདྡྷེ་སིདྡྷེ།
en: So, for their benefit and to set them on the path to the awakening of a buddha, he taught the following dhāraṇī mantra verses that eliminate all karmic obscurations:

source: སུ་སིདྡྷེ། མོ་ཙ་ནི། མོ་ཀྵ་ཎི། མུཀྟེ། བི་མུཀྟེ། ཨ་མ་ལེ། བི་མ་ལེ། མཱྃ་ག་ལྱེ། ཧི་ར་ཎྱ་གརྦྷེ། རཏྣ་གརྦྷེ། སརྦ་ཨརྠ་སཱ་དྷ་ནི། པ་ར་མ་ཨརྠ་སཱ་དྷ་ནི། མ་ན་སེ། མ་ཧཱ་མ་ན་སེ། ཨདྦྷུ་ཏེ། བཱི་ཏ་བྷ་ཡེ། སུ་བརྞྞེ། བྲ་ཧྨ་གྷོ་ཥེ། བྲཧྨཱ་དྷྱུ་ཥི་ཏེ།
en: “tadyathā siddhe siddhe susiddhe mocani mokṣaṇi mukte vimukte amale vimale māṅgalye hiranya­garbhe ratna­garbhe sarvārthasādhani para­mārthasādhani manase mahā­manase adbhute atyadbhute vītabhaye suvarṇe brahmaghoṣe brahmādhyuṣite sarvārtheṣu aparājite sarva­trāpratihate catuḥṣaṣṭhi­bhūtakoṭi­bhāṣite namaḥ sarva­tathāgatānāṃ ­svāhā.”

source: སརྦ་ཨརྠྠེ་ཥུ་ཨ་པ་རཱ་ཛི་ཏེ། སརྦ་ཏྲ་ཨ་པྲ་ཏི་ཧ་ཏེ། ཙ་ཏུ་ཥྵ་ཥྛི་བྷཱུ་ཏ་ཀོ་ཊི་བྷཱ་ཥི་ཏེ། ན་མཿསརྦ་ཏ་ཐཱ་ག་ཏཱ་ནཱཾ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་ཀྱིས་གཟུངས་སྔགས་འདི་གསུངས་པ་ན་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་འདུས་པ་ཐམས་ཅད་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཀྱིས་བཅོམ་ལྡན་འདས་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གསོལ་ཏེ།
en: When the Blessed One spoke this dhāraṇī mantra, the entire gathering of bodhisattvas, Śakra, Brahmā, and all the guardians of the world praised the Blessed One saying, “Wonderful!

source: བཅོམ་ལྡན་འདས་ཁྱོད་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་སྡིག་པ་ཐམས་ཅད་བསལ་བ་དང་། ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱི་བ་དང་། རེ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐང་བའི་སླད་དུ་གཟུངས་སྔགས་ཀྱི་ཚིག་འདི་ལྟ་བུ་འདི་དག་བཀའ་སྩལ་པ་ལེགས་སོ་ལེགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གྲོགས་པོ་དག་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོའམ། རྒྱལ་པོ་འམ།
en: Blessed One, it is wonderful that you have proclaimed this dhāraṇī mantra verse to show love to all beings, to clear away all their misdeeds, pacify all their illnesses, and fulfill all their hopes.”

source: རྒྱལ་བུའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་ཡོན་ཏན་དོན་དུ་གཉེར་བ་གང་སུའང་རུང་སྟེ། གཟུངས་ཀྱི་ཚིག་འདི་དག་འཛིན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། དད་པར་བྱེད་པ་དང་། ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་བའི་སེམས་ཡིད་ལ་བྱེད་པ་དང་། མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། མར་མེ་རྣམས་ཀྱིས་མཆོད་པ་གཙང་མར་བྱས་ཏེ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་དང་ལྡན་པར་བྱས་ན། དེའི་མཚམས་མེད་པ་ལྔ་ལ་སོགས་པ་སྡིག་པ་ཐམས་ཅད་ཡོངས་སུ་བྱང་བར་འགྱུར།
en: “My friends,” the Blessed One replied, “If any son or daughter of good family or any king, prince, or male or female layperson who seeks such good qualities retains these dhāraṇī verses, recites them, masters them, cultivates faith in them, reflects on an attitude of compassion toward all beings three times each day and three times each night, makes a pure offering with flowers, incense, and perfume, and acts according to the eightfold path of noble beings, all their misdeeds including the five inexpiable acts and the rest will be purified.

source: འདི་ནས་ཤི་འཕོས་ནས་འཇིག་རྟེན་གྱི་ཁམས་དེར་སྐྱེ་བར་འགྱུར་ཏེ། པདྨའི་སྙིང་པོ་སེང་གེའི་ཁྲི་ལ་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར།
en: When they pass away, they will be born in that world, where they will take miraculous birth upon a lion throne in the middle of a lotus.

source: ནད་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར། འཆི་བ་དང་། དགྲ་དང་། དགོན་པའི་གནོད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར།
en: All their illnesses and all manner of threats related to death, enemies, and the wilderness will be pacified.

source: འཆི་བའི་དུས་ཀྱི་ཚེ་ཡང་དེ་བཞིན་གཤེགས་པས་དགོངས་པར་འགྱུར། རེ་བ་དང་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: When they die, the Thus-Gone One will turn their attention toward them, and all their hopes and wishes will be fulfilled.

source: །འཇམ་དཔལ་ཤར་ཕྱོགས་ལོགས་སུ་འཇིག་རྟེན་གྱི་ཁམས་གང་གའི་ཀླུང་བདུན་གྱི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མྱ་ངན་མེད་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་མཆོག་དཔལ་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་ཡོད་དོ།
en: “Mañjuśrī, to the east of this buddhafield, past as many buddhafields as there are grains of sand in seven Gaṅgā rivers, the thus-gone, worthy, and perfect Buddha Aśokottamaśrī lives in the world Without Anguish. There he lives, resides, and teaches the Dharma.

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་མཆོག་དཔལ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་ལག་མཐིལ་ལྟར་མཉམ་པ། ཐ་གྲུ་ཆེ་བ། ཡངས་པ།
en: Mañjuśrī, the blessed, thus-gone, worthy, and perfect Buddha Aśokottamaśrī’s buddhafield is even like the palm of one’s hand, wide, and spacious.

source: མྱ་ངན་དང་། ངན་སོང་དང་། སྡུག་བསྔལ་གྱི་སྒྲ་མེད་པ།
en: There is no mental anguish and there are no lower realms or cries of suffering.

source: ས་གཞི་འཇམ་ཞིང་ཤིན་ཏུ་སྙི་བ།
en: The ground is soft and very smooth.

source: ལྷའི་སྤོས་ཀྱིས་བདུགས་པ། ལྷའི་ནོར་བུ་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པས་མཛེས་པར་བྱས་པ།
en: The scent of divine perfume fills the air, and it is beautified by trees made of divine precious jewels.

source: ལྷའི་འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་རྫིང་སྤོས་ཆུས་ཡོངས་སུ་གང་བ།
en: There are divine pools made of gold from the Jambū river that are filled with perfumed water.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ལྗོན་པ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་དང་ལྡན་པ།
en: The trees are made of the seven precious substances and covered with flowers and fruit.

source: ལྷའི་རོལ་མོའི་སྒྲ་དང་། སིལ་སྙན་གྱི་སྒྲ་དང་ལྡན་པ་སྟེ།
en: This buddhafield is filled with divine music and the sound of instruments.

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་དཔག་མེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ཇི་ལྟ་བ་བཞིན་དུ།
en: In short, Mañjuśrī, it is just like the thus-gone, worthy, and perfect Buddha Amitābha’s buddhafield Sukhāvatī.

source: འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་མཆོག་དཔལ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཡི་ཡོན་ཏན་བཀོད་པ་ཡང་དེ་དང་འདྲའོ།
en: Mañjuśrī, such is the array of good qualities of the thus-gone, worthy, and perfect Buddha Aśokottamaśrī’s buddhafield.

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་མཆོག་དཔལ་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་ཆེན་པོ་བཞི་བཏབ་བོ། །བཞི་གང་ཞེ་ན།
en: “Mañjuśrī, the blessed, thus-gone, worthy, and perfect Buddha Aśokottamaśrī proclaimed the following four great aspirations long ago, when he was practicing bodhisattva conduct:

source: དེའི་སྨོན་ལམ་ཆེན་པོ་དང་པོ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་མྱ་ངན་དང་། སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་མང་བ། སྡུག་བསྔལ་རྣམ་པ་སྣ་ཚོགས་མྱོང་བ་དེར་སེམས་ཅན་གང་དག་གིས་བདག་གི་མིང་ཐོས་ལ།
en: “For his first great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who are anguished, who suffer, who are unhappy, and who experience a great deal of conflict and various kinds of suffering hear my name.

source: ཐོས་ནས་ཀྱང་ཡིད་ལ་བྱེད་པ་དེ་དག་བདག་གི་མཐུས་མྱ་ངན་དང་། སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །སུ་ཡང་སྡུག་པ་དང་བྲལ་བའི་སྡུག་བསྔལ་མྱོང་བར་མ་གྱུར་ཅིག །ཚེ་རིང་པོར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: After they hear and think about my name, may my power quell all of their mental anguish, suffering, unhappiness, and conflict. May none of them ever experience the suffering of being separated from what they hold dear, and may they have long lives.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གཉིས་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་སྡིག་པ་མི་དགེ་བ་རྣམ་པ་སྣ་ཚོགས་བྱས་ཏེ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་བསྟིར་མེད་པ་ཆེན་པོ་མུན་པ་མུན་ནག་ཅན་དུ་སྐྱེས་པ་དེ་དག་ལ་བདག་གི་མཐུས། བདག་གི་ལུས་ལས་འོད་ཟེར་གྱི་སྣང་བ་འདི་ལྟ་བུ་བྱུང་སྟེ།
en: “For his second great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause the light that radiates from my body to shine on any beings who commit various misdeeds and nonvirtuous actions and who are thus reborn in the great hells, or in the Great Avīci Hell where they are shrouded in thick darkness.

source: དེས་སེམས་ཅན་དམྱལ་བ་པ་དེ་དག་ལ་རེག་ཅིང་མཐོང་མ་ཐག་ཏུ་སྡིག་པ་ཐམས་ཅད་བྱང་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོའི་སྡུག་བསྔལ་དེ་དག་ལས་ཡོངས་སུ་ཐར་བར་གྱུར་ཅིག །སྡུག་བསྔལ་གྱི་ཚོར་བ་ཐམས་ཅད་རྒྱུན་ཆད་པར་གྱུར་ཅིག །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ། ལྷ་དང་མིའི་བདེ་བ་རྨྱོང་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: May the light touch those hell beings and purify all their misdeeds as soon as they see it. May they be liberated from the sufferings of the great hells, and may it bring an end to all their pain. May they experience the joy of the divine and human realms for as long as it takes them to become perfect buddhas who have manifested unsurpassed and perfect awakening.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གསུམ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་སྔོན་སྡིག་པ་མི་དགེ་བ་བྱས་ཏེ། གཞན་གྱི་རྫས་ཕྲོགས་པས་དབུལ་པོ་དམན་པའི་ཁྱིམ་དུ་སྐྱེས་ནས་གོས་དང་། བཟའ་བ་དང་། བཏུང་བ་དང་། མལ་ཆ་དང་། རྒྱན་མི་བདོག་པ། གྲང་བ་དང་། ཚ་བའི་སྡུག་བསྔལ་མྱོང་བ།
en: “For his third great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who have committed misdeeds and nonvirtuous actions in a previous life, who were born into a poor household of low standing because they stole another person’s property, and who thus do not have clothing, food, drink, bedding, or jewelry, those who suffer from both cold and heat, those whose bodies are tormented by hunger and thirst, and those who have poor complexions hear and recite my name.

source: བཀྲེས་པ་དང་། སྐོམ་པས་ལུས་གཟིར་ཅིང་མདོག་ངན་པ་དེ་དག་གིས་བདག་གི་མིང་ཐོས་ནས་བརྗོད་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་བགོ་བ་དང་། བཟའ་བ་དང་། བཏུང་བ་དང་། མལ་ཆ་ཐམས་ཅད་ལ་ཡོངས་སུ་སྤྱོད་པར་གྱུར་ཅིག །ལུས་ལ་ལྷའི་ལུས་ཀྱི་ཁ་དོག་གིས་བརྒྱན་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: As a result, may they possess clothing, food, drink, and bedding for as long as it takes them to become perfect buddhas who have manifested unsurpassed and perfect awakening, and may their bodies take on beautiful, divine complexions.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་བཞི་པ་ནི། གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟ་རྣམས་ཀྱིས་གཙེས་ཤིང་མདངས་ཕྲོགས་ཏེ་ནད་ཀྱི་སྡུག་བསྔལ་སྣ་ཚོགས་རྨྱོང་བ་དེ་དག་གིས་བདག་གི་མིང་ཐོས་ནས་བདག་གི་མཐུས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། འབྱུང་པོ་དང་། ཤ་ཟས་མདངས་འཕྲོག་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །བྱམས་པ་ལ་གནས་པར་གྱུར་ཅིག །ནད་ཀྱི་སྡུག་བསྔལ་སྣ་ཚོགས་ལས་ཡོངས་སུ་ཐར་བར་གྱུར་ཅིག་ཅེས་བཏབ་སྟེ།
en: “For his fourth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who are tormented and have their vital energy stolen by yakṣas, rākṣasas, bhūtas, and piśācas and thus suffer from the various types of suffering related to illness hear my name. May my power cause all the yakṣas, rākṣasas, bhūtas, and piśācas who steal beings’ vital energy to be pacified and benevolent toward those people for as long as it takes them to become perfect buddhas who have manifested unsurpassed and perfect awakening.

source: འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེས་སྨོན་ལམ་ཆེན་པོ་བཞི་པོ་དེ་དག་བཏབ་བོ།
en: May they be liberated from the various types of suffering related to illness.’ Mañjuśrī, those are the four great aspirations that this blessed one proclaimed.

source: །འཇམ་དཔལ་གང་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མྱ་ངན་མེད་མཆོག་དཔལ་དེའི་མཚན་ཐོས་ཏེ་ཉིན་ལན་གསུམ་མཚན་ལན་གསུམ་བརྗོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པར་གནས་པར་བྱ་སྟེ།
en: “Mañjuśrī, those who hear the name of the blessed, thus-gone, worthy, and perfect Buddha Aśokottamaśrī should recite it three times each day and three times each night and cultivate benevolence toward all beings.

source: དེ་བཞིན་གཤེགས་པ་དེ་ལ་ཡང་མཆོད་པ་བྱེད་པ་དེ་དག་གི་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་བྱང་བར་འགྱུར།
en: All the karmic obscurations of those who make offerings to that thus-gone one will be purified.

source: མྱ་ངན་དང་། སྡུག་བསྔལ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར།
en: They will be free from mental anguish, suffering, unhappiness, and conflict.

source: རྟག་ཏུ་ནད་མེད་པ་དང་ལྡན་པར་འགྱུར། ཡུན་རིང་དུ་འཚོ་ཞིང་ནད་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར།
en: They will always be healthy, they will have long lives, and they will be free from all manner of illnesses.

source: བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་ངན་འགྲོ་ལོག་པར་ལྟུང་བར་འགྲོ་བར་མི་འགྱུར། སྐྱེ་བ་དྲན་པར་འགྱུར།
en: They will never fall into lower rebirths for as long as it takes them to attain awakening, and they will remember their former rebirths.

source: དེ་བཞིན་གཤེགས་པ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་པདྨའི་སྙིང་པོའི་སེང་གེའི་ཁྲི་ལ་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར། ལྷ་ཐམས་ཅད་ཀྱིས་རྗེས་སུ་བསྲུང་བར་འགྱུར་ཏེ།
en: They will take miraculous rebirth in that thus-gone one’s buddhafield on a lion throne bedecked with the seven precious substances in the middle of a lotus, and all the gods will protect them.

source: འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེའི་མཚན་ཐོས་པ་ནི་དེ་ལྟར་ཡོན་ཏན་མང་པོ་དག་དང་ལྡན་ནོ།
en: Mañjuśrī, such are the many good qualities related to reciting the name of that thus-gone one.

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་སྨོན་ལམ་གྱི་ཁྱད་པར་རྒྱས་པ་གང་ཡིན་པ་དེ་ནི། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མ་གཏོགས་པར། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བརྗོད་པར་མི་ནུས་སོ།
en: “Mañjuśrī, that blessed one’s buddhafield possesses such an abundant array of good qualities and his previous bodhisattva aspirations were so vast that except for the thus-gone, worthy, and perfect buddhas, no one, not even the hearers and solitary buddhas, can express them.

source: །འཇམ་དཔལ་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་བརྒྱད་ཀྱི་བྱེ་མ་སྙེད་འདས་པ་ན། འཇིག་རྟེན་གྱི་ཁམས་ཆོས་ཀྱི་རྒྱལ་མཚན་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་བསྒྲགས་རྒྱ་མཚོའི་དབྱངས་ཞེས་བྱ་བ་བཞུགས་ཏེ་འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པ་ཡོད་དོ།
en: “Mañjuśrī, to the east of this buddhafield, past as many buddhafields as there are grains of sand in eight Gaṅgā rivers, the thus-gone, worthy, and perfect Buddha Dharmakīrtisāgaraghoṣa lives in the world Victory Banner of the Dharma. There he lives, resides, and teaches the Dharma.

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཆོས་བསྒྲགས་རྒྱ་མཚོའི་དབྱངས་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་ཤིན་ཏུ་ཡོངས་སུ་དག་པ།
en: Mañjuśrī, the thus-gone, worthy, and perfect Buddha Dharmakīrtisāgaraghoṣa’s buddhafield is utterly pure.

source: མཉམ་པ། དྲི་མ་མེད་པ། འོད་གསལ་བ། ཨནྡ་རྙིལ་གྱི་རང་བཞིན་ཅན།
en: It is even, stainless, luminous, and like blue sapphire.

source: རྩིག་པ་དང་། ར་བ་དང་། སྐར་ཁུང་དང་། རྟ་བབས་དང་། དྲ་བ་དང་། བག་མ་ནི་ཤེལ་ལས་གྲུབ་པ།
en: The outer walls, fences, windows, archways, latticework, and turrets are made of crystal.

source: ས་གཞི་ལྷའི་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པས་མཛེས་པར་བྱས་པ་གསེར་གྱི་སྐུད་པས་མིག་མངས་རིས་སུ་བྲེས་པ།
en: The ground is adorned with trees made of divine jewels and covered with golden threads in a checkered pattern.

source: རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་ཐམས་ཅད་ལ་ཡང་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བས་བྲེས་ཤིང་དཔྱངས་པ། ལྷའི་དར་གྱི་ལྡ་ལྡི་དང་། ལྷའི་མེ་ཏོག་དང་། སྤོས་ཀྱིས་མཛེས་པར་བྱས་པ།
en: All the jeweled trees are decorated and draped with lattices of tinkling bells and beautified with divine silk tassels, divine flowers, and perfumes.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་རྫིང་ལྷའི་སྤོས་ཆུས་ཡོངས་སུ་གང་བ།
en: There are pools made of the seven precious substances and filled with perfumed water.

source: དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དེ་དག་ཀྱང་རླུང་གིས་བསྐྱོད་ཅིང་བསྒུལ་བ་ན། ལྷའི་སྒྲ་དབྱངས་ཡིད་དུ་འོང་བ་སེམས་ཅན་ཐམས་ཅད་ཡང་དག་པར་དགའ་བར་བྱེད་པ།
en: When the lattices of tinkling bells stir and shake in the breeze, their pleasant, divine melody brings joy to all beings.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་ཀྱི་ཆོས་ཀྱི་སྒྲ་སྐད་འབྱུང་བ།
en: The Dharma sound of the nature devoid of substance fills the air, and the Dharma sound of the Great Vehicle resounds from the music of divine instruments.

source: ལྷའི་སིལ་སྙན་དང་། རོལ་མོའི་སྒྲ་རྣམས་ལས་ཐེག་པ་ཆེན་པོའི་ཆོས་ཀྱི་སྒྲ་སྐད་འབྱུང་བ་དང་། སེམས་ཅན་གང་དག་གིས་ཆོས་ཀྱི་སྒྲ་དེ་ཐོས་པ་དེ་དག་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་བྲལ་བར་འགྱུར་བ། བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་བའོ།
en: The beings who hear this sound of the Dharma become free from desire, hatred, and delusion and attain the absorption called not forgetting the mind of awakening

source: འཇམ་དཔལ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་ངན་སོང་དང་སྡུག་བསྔལ་གྱི་སྒྲ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་མེད་པ། བུད་མེད་ཀྱི་དངོས་པོ་མེད་པའོ།
en: Mañjuśrī, in that world there are no lower realms, no cries of suffering, and no derivative afflictions, and there is no such thing as the female gender.

source: །བཅོམ་ལྡན་འདས་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་ཆེན་པོ་བཞི་བཏབ་བོ། །བཞི་གང་ཞེ་ན།
en: “That Blessed One proclaimed the following four great aspirations long ago, when he was practicing bodhisattva conduct:

source: དེའི་སྨོན་ལམ་ཆེན་པོ་དང་པོ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་ལོག་པར་ལྟ་བ་ཅན་གྱི་ཁྱིམ་དུ་སྐྱེས་པ། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་སེམས་མ་དད་པ། བྱང་ཆུབ་ཀྱི་སེམས་ཡིད་ལ་བྱེད་པ་ལས་རིང་དུ་གྱུར་པ་དེ་དག་གིས་བདག་གི་མིང་ཐོས་ནས།
en: “For his first great aspiration, he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who are born into a house that maintains wrong views, who have no faith in the Buddha, Dharma, and Saṅgha, and who are far from focusing on the mind of awakening hear my name.

source: བདག་གི་མཐུས་ལས་ཀྱི་སྒྲིབ་པ་དེ་ཟད་པར་གྱུར་ནས་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་ཡང་དག་པའི་ལྟ་བ་ཅན་དུ་གྱུར་ཅིག །སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་དད་པ་མི་ཕྱེད་པ་དང་ལྡན་པར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་སེམས་ཡིད་ལ་བྱེད་པ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: By my power, may their karmic obscurations be eliminated, and may they adopt the correct view for as long as it takes them to attain awakening. May they possess unbreakable faith in the Buddha, Dharma, and Saṅgha, and may they never regress from focusing on the mind of awakening.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གཉིས་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་གང་ན་སངས་རྒྱས་ཀྱི་སྒྲ་མི་གྲག་པ་དང་། ཆོས་ཀྱི་སྒྲ་མི་གྲག་པ། དགེ་འདུན་གྱི་སྒྲ་མི་གྲག་པ། ཡུལ་མཐའ་འཁོབ་དག་ཏུ་སྐྱེས་ཏེ། མི་དགེ་བའི་བཤེས་གཉེན་གྱི་རྒྱུས་སྡིག་པའི་ལས་བྱེད་པ་དེ་དག་དེ་ནས་ཤི་འཕོས་ནས་ངན་སོང་གསུམ་དུ་ལྟུང་ཞིང་དགེ་བའི་ཆོས་རྣམས་ལས་ཡོངས་སུ་ཉམས་པར་འགྱུར་བ་དེ་དག་ལ་བདག་གི་མཐུས་བདག་གི་མིང་རྣ་ལམ་དུ་གྲག་ཅིང་ཆོས་ཀྱི་སྤྲིན་དང་། རྒྱ་མཚོའི་སྒྲ་འབྱུང་བར་གྱུར་ཅིག །དེ་དག་གིས་ཆོས་ཀྱི་སྒྲ་དེ་ཐོས་ནས་སྔོན་གྱི་ལས་ཟད་པར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་བྱང་ཆུབ་ཀྱི་སེམས་ཡིད་ལ་བྱེད་པ་དང་མི་འབྲལ་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: “For his second great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings who have been born in border countries where they have not heard the terms Buddha , Dharma , and Saṅgha , who engage in unwholesome actions because of the nonvirtuous company they keep, and who fall into the three lower realms after they pass away and lose all their virtuous qualities to hear my name. When they do, may the sound of the Dharma fill the air like clouds of Dharma or crashing waves. Upon hearing this, may all the karma of their previous lives be eliminated, and may their thoughts never stray from the mind of awakening for as long as it takes them to attain awakening.’
